{
    "header": {
        "message": "Bienvenido al sitio web de Pranjal"
    },
    "home": {
        "intro1": "Hola, soy",
        "intro2": "Un desarrollador web de pila completa.",
        "moreButton": "Más Sobre Mí"
    },
    "about": {
        "title": "Sobre mí",
        "discription": "Desarrollador de Java talentoso con 2 años de experiencia profesional, destacando tanto en el desarrollo backend como frontend para crear aplicaciones completas. Con experiencia en la integración sin problemas, pruebas rigurosas y el fortalecimiento de aplicaciones empresariales, con un sólido historial de proporcionar un soporte robusto. Competente en la construcción de sistemas backend sólidos e interfaces de usuario intuitivas, aprovechando Java, Spring Framework y bibliotecas de JavaScript dentro de los dominios de salud, logística de la cadena de suministro y comercio electrónico. Además, con habilidades en el desarrollo de aplicaciones móviles multiplataforma usando React Native. Experiencia práctica con Kafka, ActiveMQ, Docker y Google Cloud Platform (GCP)."
    },
    "projects": {
        "title": "Proyectos",
        "webDevelopment": "Desarrollo Web",
        "ML": "Aprendizaje Automático, Realidad Aumentada y Aplicación Android",
        "backendDevelopment": "Desarrollo Backend",
        "web": [
            { "title": "Portafolio Personal", "description": "Un sitio web de portafolio personal que muestra mis proyectos y habilidades." },
            { "title": "Proyecto de Sitio Web Inmobiliario", "description": "La aplicación inmobiliaria ofrece características para explorar, comprar, vender y alquilar propiedades. Incluye filtros de búsqueda avanzados, mapas interactivos y herramientas de valoración de propiedades." }
        ],
        "data": [
            { 
                "title": "Dr. Dermo", 
                "description": "Dr. Dermo es una aplicación Android que verifica a los usuarios para detectar enfermedades de la piel. El modelo de aprendizaje automático se realizó utilizando TensorFlow. Con la detección de la enfermedad, también proporciona al usuario posibles remedios para la enfermedad y los hospitales cercanos. En nuestro proyecto, proponemos un sistema de diagnóstico que permite a los usuarios reconocer enfermedades de la piel. Esta aplicación proporciona resultados precisos en menos tiempo, también ofrecemos consejos o tratamientos al usuario. Por un lado, puede ser útil para los dermatólogos para reducir las deficiencias clínicas y sirve como una prueba temprana para los pacientes en áreas rurales que carecen de un buen experto médico. Además, la aplicación también funciona para recordar al usuario que tome los medicamentos recetados a tiempo. El conjunto de datos utilizado fue de la Universidad de Tsukuba."
            },
            { 
                "title": "CarCart", 
                "description": "CarCart es una aplicación Android futurista y fácil de usar con capacidades de aprendizaje automático y realidad aumentada. Permite al usuario cargar la imagen del coche que se puede procesar para detectar el coche más probable. El modelo de aprendizaje automático está entrenado en el conjunto de datos de coches de Stanford que contiene 196 clases de coches. Por lo tanto, este problema se clasifica como un problema de clasificación multietiqueta. Además, los usuarios podrán ver varios modelos de coches disponibles en el mercado junto con sus especificaciones y transmisión de video, obtener una lista de concesionarios y centros de servicio cercanos, establecer recordatorios de servicio, proporcionar sus comentarios, realizar encuestas sobre coches usados, verificar su disponibilidad y precios, contactar con concesionarios de coches, introduciendo así el concepto de venta al por menor. La aplicación también muestra el prototipo 3D en tamaño real de ciertos modelos de coches seleccionados usando realidad aumentada. Por lo tanto, el usuario puede considerar todos los factores esenciales antes de tomar una decisión informada según sus requisitos."
            }
        ],
        "mobile": [
            { "backendDevelopment": "Sistema de Insignias",
            "title": "Sistema de Insignias", "description": "La aplicación del Sistema de Insignias proporciona una solución eficiente y segura para el seguimiento de la asistencia en varias instalaciones dentro de MIU. Al replicar la funcionalidad de los escáneres físicos e incorporar características como el control de acceso basado en roles, la integración de seguridad OAuth, la aplicación agiliza los procesos de gestión de asistencia mientras garantiza la seguridad y confiabilidad de los datos." }
        ]
    },
    "form": {
    "title":"Conéctate con Nosotros",
    "name": "Nombre",
    "email": "Correo Electrónico",
    "message": "Mensaje",
    "submit": "Enviar"
  },
  "contact": {
    "title": "Contáctame",
    "subtitle": "¡A solo una llamada, correo o mensaje de distancia!",
    "addressTitle": "DIRECCIÓN",
    "address": "Cincinnati, OH",
    "phoneTitle": "NÚMERO DE CONTACTO",
    "phone": "+1 929-682-4775",
    "emailTitle": "DIRECCIÓN DE CORREO ELECTRÓNICO",
    "email": "pranjal.sharm98@gmail.com",
    "websiteTitle": "SITIO WEB",
    "website": "pranjalsharma13.github.io/my-website/"
  }
}
