{
    "header": {
        "message": "प्रांजल की वेबसाइट पर आपका स्वागत है"
    },
    "home": {
        "intro1": "नमस्ते, मैं हूँ",
        "intro2": "एक फुल-स्टैक वेब डेवलपर।",
        "moreButton": "मेरे बारे में और जानें"
    },
    "about": {
        "title": "मेरे बारे में",
        "discription": "2 साल के पेशेवर अनुभव के साथ प्रतिभाशाली जावा डेवलपर, जो बैकएंड और फ्रंटएंड विकास में उत्कृष्टता प्राप्त करता है और व्यापक अनुप्रयोग बनाने के लिए। एंटरप्राइज अनुप्रयोगों को निर्बाध रूप से एकीकृत करने, कड़े परीक्षण करने और मजबूत समर्थन प्रदान करने का मजबूत ट्रैक रिकॉर्ड। स्वास्थ्य, आपूर्ति श्रृंखला लॉजिस्टिक्स और ई-कॉमर्स डोमेन के भीतर जावा, स्प्रिंग फ्रेमवर्क और जावास्क्रिप्ट लाइब्रेरी का लाभ उठाकर मजबूत बैकएंड सिस्टम और सहज यूजर इंटरफेस बनाने में प्रवीण। इसके अतिरिक्त, रिएक्ट नेटिव का उपयोग करके क्रॉस-प्लेटफॉर्म मोबाइल ऐप्स विकास में कुशल। काफ्का, एक्टिवएमक्यू, डॉकटर और गूगल क्लाउड प्लेटफार्म (जीसीपी) के साथ व्यावहारिक अनुभव।"
    },
    "projects": {
        "title": "प्रोजेक्ट्स",
        "webDevelopment": "वेब विकास",
        "ML": "मशीन लर्निंग, ऑगमेंटेड रियलिटी और एंड्रॉइड एप्लिकेशन",
        "backendDevelopment": "बैकएंड विकास",
        "web": [
            { "title": "पर्सनल पोर्टफोलियो", "description": "मेरे प्रोजेक्ट्स और कौशल को प्रदर्शित करने वाली एक पर्सनल पोर्टफोलियो वेबसाइट।" },
            { "title": "रियल एस्टेट वेबसाइट प्रोजेक्ट", "description": "रियल एस्टेट एप्लिकेशन उपयोगकर्ताओं के लिए संपत्तियों का अन्वेषण, खरीद, बिक्री और किराए पर लेने की सुविधाएं प्रदान करता है। उन्नत खोज फ़िल्टर, इंटरैक्टिव मानचित्र और संपत्ति मूल्यांकन उपकरण शामिल हैं।" }
        ],
        "data": [
            { 
                "title": "डॉ. डर्मो", 
                "description": "डॉ. डर्मो एक एंड्रॉइड एप्लिकेशन है जो उपयोगकर्ताओं को त्वचा रोग के लिए जांचता है। मशीन लर्निंग मॉडल टेन्सरफ्लो का उपयोग करके बनाया गया था। रोग का पता लगाने के साथ-साथ यह उपयोगकर्ता को संभावित उपचार और आसपास के अस्पतालों के बारे में भी जानकारी प्रदान करता है। इस प्रोजेक्ट में, हमने एक डायग्नोस्टिक सिस्टम का प्रस्ताव रखा है जो उपयोगकर्ताओं को त्वचा रोग पहचानने में सक्षम बनाता है। यह एप्लिकेशन कम समय में सटीक परिणाम प्रदान करता है, साथ ही हम उपयोगकर्ता को सलाह या उपचार भी प्रदान करते हैं। दूसरी ओर, यह ग्रामीण क्षेत्रों के मरीजों के लिए उपयोगी हो सकता है जहां एक अच्छे चिकित्सा विशेषज्ञ की कमी होती है। इसके अलावा, एप्लिकेशन उपयोगकर्ता को निर्धारित दवाएं समय पर लेने की याद दिलाने के लिए भी कार्य करता है। इस प्रोजेक्ट के लिए डेटा सेट यूनिवर्सिटी ऑफ त्सुकुबा से प्राप्त किया गया था।"
            },
            { 
                "title": "कारकार्ट", 
                "description": "कारकार्ट एक यूज़र-फ्रेंडली भविष्यवादी एंड्रॉइड एप्लिकेशन है जिसमें मशीन लर्निंग और ऑगमेंटेड रियलिटी क्षमताएं शामिल हैं। यह उपयोगकर्ता को कार की छवि अपलोड करने की अनुमति देता है जिसे प्रोसेस करके सबसे संभावित कार का पता लगाया जा सकता है। मशीन लर्निंग मॉडल को स्टैनफोर्ड कार डेटा सेट पर प्रशिक्षित किया गया है जिसमें 196 कार वर्ग शामिल हैं। इसलिए, इस समस्या को मल्टी-लेबल वर्गीकरण समस्या के रूप में वर्गीकृत किया गया है। इसके अतिरिक्त, उपयोगकर्ता बाजार में उपलब्ध विभिन्न कार मॉडल को उनकी विशिष्टताओं और वीडियो फीड के साथ देख सकेंगे, पास के शो-रूम और सर्विस सेंटरों की सूची प्राप्त कर सकेंगे, सेवा रिमाइंडर सेट कर सकेंगे, अपनी प्रतिक्रिया दे सकेंगे, उपयोग की गई कारों पर सर्वेक्षण कर सकेंगे, उनकी उपलब्धता और कीमतें देख सकेंगे, कार डीलरों से संपर्क कर सकेंगे, इस प्रकार खुदरा अवधारणा को प्रस्तुत कर सकेंगे। एप्लिकेशन ऑगमेंटेड रियलिटी का उपयोग करके चयनित कार मॉडल के लाइव-साइज 3डी प्रोटोटाइप को भी प्रदर्शित करता है। इसलिए, उपयोगकर्ता अपनी आवश्यकता के अनुसार सूचित निर्णय लेने से पहले सभी आवश्यक कारकों पर विचार कर सकते हैं।"
            }
        ],
        "mobile": [
            { "backendDevelopment": "बैज सिस्टम",
            "title": "बैज सिस्टम", "description": "बैज सिस्टम एप्लिकेशन एमआईयू के विभिन्न सुविधाओं में उपस्थिति को ट्रैक करने के लिए एक कुशल और सुरक्षित समाधान प्रदान करता है। भौतिक स्कैनर की कार्यक्षमता को दोहराकर और रोल-आधारित एक्सेस कंट्रोल, OAuth सुरक्षा एकीकरण जैसी सुविधाओं को शामिल करके, एप्लिकेशन उपस्थिति प्रबंधन प्रक्रियाओं को सुव्यवस्थित करते हुए डेटा सुरक्षा और विश्वसनीयता सुनिश्चित करता है।" }
        ]
    },
    "form": {
      "title":"हमसे जुड़ें",
      "name": "नाम",
      "email": "ईमेल",
      "message": "संदेश",
      "submit": "जमा करें"
    },
    "contact": {
    "title": "मुझसे संपर्क करें",
    "subtitle": "केवल एक कॉल, मेल, संदेश की दूरी पर!",
    "addressTitle": "पता",
    "address": "सिंसिनाटी, ओहायो",
    "phoneTitle": "संपर्क संख्या",
    "phone": "+1 929-682-4775",
    "emailTitle": "ईमेल पता",
    "email": "pranjal.sharm98@gmail.com",
    "websiteTitle": "वेबसाइट",
    "website": "pranjalsharma13.github.io/my-website/"
  }
}
